---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Viscosity
source: html/c3843a0f-7bdf-13af-4a01-952da0441622.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Viscosity Property

The viscosity of the pipe. Units: (kg/(ft·s)).

## Syntax (C#)
```csharp
public double Viscosity { get; }
```